{
    "name": "Odyssey VR",
    "description": "Odyssey VR, the innovative operating system by NexaSphere, offers a captivating social media experience in virtual reality. It serves as a gateway to connect, explore, and interact in diverse virtual landscapes, blending elements of social networking with immersive environments.",
        "locations": [
        {
            "name": "Lobby",
            "description": "Your personal VR space in Odyssey VR. This customizable home is where you can display items and memories collected during your virtual adventures. It's a reflection of your style and interests, a personal haven in the expansive digital universe of NexaSphere.",
            "main-entry": true,
            "keywords": ["personal", "customizable", "interactive"],
            "paths": {},
            "items": [
                {
                    "name": "Virtual Aquarium",
                    "description": "A customizable aquarium with virtual fish. Change scenes at will.",
                    "type": "Decor",
                    "collectable": false,
                    "quantity": 1
                },
                {
                    "name": "Zero-Gravity Chair",
                    "description": "A chair that simulates zero-gravity for ultimate relaxation, adjusting to any desired position.",
                    "type": "Decor",
                    "collectable": false,
                    "quantity": 1
                },
                {
                    "name": "Holographic Music System",
                    "description": "An interactive music system that visualizes songs as holographic soundwaves and melodies.",
                    "type": "Tech",
                    "collectable": false,
                    "quantity": 1
                },
                {
                    "name": "Dimensional Puzzle Cube",
                    "description": "A complex, interactive puzzle cube that changes shape and size, offering a challenging and engaging experience.",
                    "type": "Interactive",
                    "collectable": true,
                    "quantity": 1
                }
            ],
            "containers": [
                {
                    "name": "Cube",
                    "description": "Store and revisit favorite VR moments.",
                    "type": "Container",
                    "isOpen": false,
                    "collectable": false,
                    "interactions": [
                        {
                            "type": "open",
                            "description": "Open the cube to view its contents."
                        },
                        {
                            "type": "close",
                            "description": "Close the cube."
                        }
                    ],
                    "inventory": []
                }
            ],
"npcs": [
                {
                    "name": "Athena",
                    "description": "Athena, the AI digital assistant, provides guidance, game tips, and helpful information. She appears as a friendly holographic avatar and adapts to the user's preferences.",
                    "keywords": ["AI", "avatar", "assistant", "guide", "helper", "hologram", "holographic", "interactive", "virtual"],
                    "interactions": [
                        {
                            "type": "Tutorial",
                            "description": "Provides a step-by-step guide to new players about navigating and using Odyssey VR's features."
                        },
                        {
                            "type": "talk to",
                            "dialog": [
                                "Welcome to Odyssey VR! How can I assist you today?",
                                "Here are some tips for customizing your virtual home.",
                                "I can help you connect with friends or explore new virtual landscapes.",
                                "Need assistance with any in-game challenges or quests? I'm here to help!",
                                "Feeling lost? I can guide you to any location within Odyssey VR.",
                                "If you're looking for something fun to do, I can suggest some popular activities and events."
                            ]
                        }
                    ],
                    "inventory": []
                }
                
            ],
            "rooms": [],
            "sublocations": []
        }
    ]
}
